Back-End/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.save
---
INSERT INTO "comments" ("movie_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movie_id", 726739], ["text", "p"], ["created_at", "2020-10-02 18:37:52.699436"], ["updated_at", "2020-10-02 18:37:52.699436"]]