Back-End/app/controllers/registrations_controller.rb

    def create
      user = User.create!(
        name: params['user']['name'],
        password: params['user']['password'],
        password_confirmation: params['user']['password_confirmation']
      )
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"