Back-End/app/controllers/sessions_controller.rb

    def create
      user = User
              .find_by(name: params["user"]["name"])
              .try(:authenticate, params["user"]["password"])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "T-rex"], ["LIMIT", 1]]